# Python but primarily pandas review

### The pandas library and DataFrames

The first thing you'll usually do when writing Python code is to import any libraries that you'll need. When working with data files, the pandas library offers all sorts of convenient functionality.

In [1]:
import pandas as pd

In [13]:
from IPython.display import clear_output

clear_output()

We will use read_csv to import data from text files. This assumes that you have a folder called data and the file is placed in that folder. Do you?  

What does read_csv do for you? What does csv mean?

In [3]:
# You can do this in one or in two steps.  First, specify where the file is located:
path_to_data = '../data/gapminder.tsv'
#if you are not using a data directory:
#path_to_data = 'gapminder.tsv'
# Now import the file
data = pd.read_csv(path_to_data, sep="\t")

What went wrong?

ALWAYS, <b>ALWAYS</b> look at the data

In [4]:
data.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [5]:
data.tail()

       country continent  year  lifeExp       pop   gdpPercap
1699  Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700  Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701  Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [6]:
data.shape

(1704, 6)

In [7]:
data.size

10224

Why do head and tail have parentheses but shape and size do not?

### Getting a sense of your data

In [8]:
data.dtypes

country       object
continent     object
year           int64
lifeExp      float64
pop            int64
gdpPercap    float64
dtype: object

In [ ]:
data.columns

In [9]:
data.describe() #Notice anything????

             year      lifeExp           pop      gdpPercap
count  1704.00000  1704.000000  1.704000e+03    1704.000000
mean   1979.50000    59.474439  2.960121e+07    7215.327081
std      17.26533    12.917107  1.061579e+08    9857.454543
min    1952.00000    23.599000  6.001100e+04     241.165876
25%    1965.75000    48.198000  2.793664e+06    1202.060309
50%    1979.50000    60.712500  7.023596e+06    3531.846988
75%    1993.25000    70.845500  1.958522e+07    9325.462346
max    2007.00000    82.603000  1.318683e+09  113523.132900

#### Column level data

In [ ]:
data['country']

In [10]:
data['country'].unique()

array(['Afghanistan', 'Albania', 'Algeria', 'Angola', 'Argentina',
       'Australia', 'Austria', 'Bahrain', 'Bangladesh', 'Belgium',
       'Benin', 'Bolivia', 'Bosnia and Herzegovina', 'Botswana', 'Brazil',
       'Bulgaria', 'Burkina Faso', 'Burundi', 'Cambodia', 'Cameroon',
       'Canada', 'Central African Republic', 'Chad', 'Chile', 'China',
       'Colombia', 'Comoros', 'Congo, Dem. Rep.', 'Congo, Rep.',
       'Costa Rica', "Cote d'Ivoire", 'Croatia', 'Cuba', 'Czech Republic',
       'Denmark', 'Djibouti', 'Dominican Republic', 'Ecuador', 'Egypt',
       'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Ethiopia',
       'Finland', 'France', 'Gabon', 'Gambia', 'Germany', 'Ghana',
       'Greece', 'Guatemala', 'Guinea', 'Guinea-Bissau', 'Haiti',
       'Honduras', 'Hong Kong, China', 'Hungary', 'Iceland', 'India',
       'Indonesia', 'Iran', 'Iraq', 'Ireland', 'Israel', 'Italy',
       'Jamaica', 'Japan', 'Jordan', 'Kenya', 'Korea, Dem. Rep.',
       'Korea, Rep.', 'Kuwait', 'Lebanon', 'Lesotho', 'Liberia', 'Libya',
       'Madagascar', 'Malawi', 'Malaysia', 'Mali', 'Mauritania',
       'Mauritius', 'Mexico', 'Mongolia', 'Montenegro', 'Morocco',
       'Mozambique', 'Myanmar', 'Namibia', 'Nepal', 'Netherlands',
       'New Zealand', 'Nicaragua', 'Niger', 'Nigeria', 'Norway', 'Oman',
       'Pakistan', 'Panama', 'Paraguay', 'Peru', 'Philippines', 'Poland',
       'Portugal', 'Puerto Rico', 'Reunion', 'Romania', 'Rwanda',
       'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia',
       'Sierra Leone', 'Singapore', 'Slovak Republic', 'Slovenia',
       'Somalia', 'South Africa', 'Spain', 'Sri Lanka', 'Sudan',
       'Swaziland', 'Sweden', 'Switzerland', 'Syria', 'Taiwan',
       'Tanzania', 'Thailand', 'Togo', 'Trinidad and Tobago', 'Tunisia',
       'Turkey', 'Uganda', 'United Kingdom', 'United States', 'Uruguay',
       'Venezuela', 'Vietnam', 'West Bank and Gaza', 'Yemen, Rep.',
       'Zambia', 'Zimbabwe'], dtype=object)

In [ ]:
#how many are there?
len(data['country'].unique())

In [11]:
data['continent'].value_counts()

continent
Africa      624
Asia        396
Europe      360
Americas    300
Oceania      24
Name: count, dtype: int64

In [14]:
#Find the maximum life expectancy
data['lifeExp'].max()

82.603

In [15]:
#Find the minimum life expectancy
data['lifeExp'].min()

23.599

In [16]:
#Find the mean life expectancy
data['lifeExp'].mean()

59.474439366197174

### Subsetting a data frame

What do we mean by subsetting? Creating a new data frame that contains selected elements from the original data frame. This may be only certain columns, or only certain rows.

In [17]:
#Subset columns
country_pop = data[['country', 'pop']]

In [18]:
country_pop.head()

       country       pop
0  Afghanistan   8425333
1  Afghanistan   9240934
2  Afghanistan  10267083
3  Afghanistan  11537966
4  Afghanistan  13079460

In [ ]:
#I would use this if I want all columns but a few
not_continent = data.drop(columns = ['continent'])

In [19]:
#What if I want all of the data from 2002?

data[data['year'] == 2002]

                 country continent  year  lifeExp       pop    gdpPercap
10           Afghanistan      Asia  2002   42.129  25268405   726.734055
22               Albania    Europe  2002   75.651   3508512  4604.211737
34               Algeria    Africa  2002   70.994  31287142  5288.040382
46                Angola    Africa  2002   41.003  10866106  2773.287312
58             Argentina  Americas  2002   74.340  38331121  8797.640716
...                  ...       ...   ...      ...       ...          ...
1654             Vietnam      Asia  2002   73.017  80908147  1764.456677
1666  West Bank and Gaza      Asia  2002   72.370   3389578  4515.487575
1678         Yemen, Rep.      Asia  2002   60.308  18701257  2234.820827
1690              Zambia    Africa  2002   39.193  10595811  1071.613938
1702            Zimbabwe    Africa  2002   39.989  11926563   672.038623

[142 rows x 6 columns]

In [ ]:
data_2002.head(2)

In [21]:
#What if I want all of the data from the first year recorded?
is_min_year = data['year'] == data['year'].min()
data[is_min_year]

                 country continent  year  lifeExp       pop    gdpPercap
0            Afghanistan      Asia  1952   28.801   8425333   779.445314
12               Albania    Europe  1952   55.230   1282697  1601.056136
24               Algeria    Africa  1952   43.077   9279525  2449.008185
36                Angola    Africa  1952   30.015   4232095  3520.610273
48             Argentina  Americas  1952   62.485  17876956  5911.315053
...                  ...       ...   ...      ...       ...          ...
1644             Vietnam      Asia  1952   40.412  26246839   605.066492
1656  West Bank and Gaza      Asia  1952   43.160   1030585  1515.592329
1668         Yemen, Rep.      Asia  1952   32.548   4963829   781.717576
1680              Zambia    Africa  1952   42.038   2672000  1147.388831
1692            Zimbabwe    Africa  1952   48.451   3080907   406.884115

[142 rows x 6 columns]

In [ ]:
data_early.head()

In [ ]:
data['continent'].unique()

In [ ]:
#What if we want all data from the Americas?

In [ ]:
data_Amer.head()

In [ ]:
data_Amer['continent'].value_counts()

In [ ]:
#What if we want all of the data from the Americas in 2007?

In [ ]:
data_Amer_2007.head()

### Boolean logic, and versus & and so forth

In [22]:
Amer_2007_idx = data[data['continent'] == 'Americas' and data['year'] == 2007]
data_Amer_2007 = data.loc[Amer_2007_idx]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [ ]:
data_Amer_2007.head()

In [29]:
data['country'].value_counts()

country
Afghanistan          12
Pakistan             12
New Zealand          12
Nicaragua            12
Niger                12
                     ..
Eritrea              12
Equatorial Guinea    12
El Salvador          12
Egypt                12
Zimbabwe             12
Name: count, Length: 142, dtype: int64

### Finding things: .loc versus .iloc

In [33]:
#What if we want to find the highest population in the Americas data 2007 dataframe?

is2007 = data['year'] == 2007

data[is2007]['pop'].max()

1318683096

In [ ]:
#OK but how do we get the rest of the info?

In [ ]:
#A few ways

In [ ]:
#Why doesn't this work????

In [ ]:
data_Amer_2007.head(7)

In [ ]:
data_Amer_2007.head()

#### Using inplace = True properly

In [42]:
#Let's get all of the data for Canada, Mexico, and the US
idx_select = data['country'].isin(['Canada','Mexico','United States'])
data_select = data.loc[idx_select]

In [43]:
data_select

            country continent  year  lifeExp        pop     gdpPercap
240          Canada  Americas  1952   68.750   14785584  11367.161120
241          Canada  Americas  1957   69.960   17010154  12489.950060
242          Canada  Americas  1962   71.300   18985849  13462.485550
243          Canada  Americas  1967   72.130   20819767  16076.588030
244          Canada  Americas  1972   72.880   22284500  18970.570860
245          Canada  Americas  1977   74.210   23796400  22090.883060
246          Canada  Americas  1982   75.760   25201900  22898.792140
247          Canada  Americas  1987   76.860   26549700  26626.515030
248          Canada  Americas  1992   77.950   28523502  26342.884260
249          Canada  Americas  1997   78.610   30305843  28954.925890
250          Canada  Americas  2002   79.770   31902268  33328.965070
251          Canada  Americas  2007   80.653   33390141  36319.235010
984          Mexico  Americas  1952   50.789   30144317   3478.125529
985          Mexico  Americas  1957   55.190   35015548   4131.546641
986          Mexico  Americas  1962   58.299   41121485   4581.609385
987          Mexico  Americas  1967   60.110   47995559   5754.733883
988          Mexico  Americas  1972   62.361   55984294   6809.406690
989          Mexico  Americas  1977   65.032   63759976   7674.929108
990          Mexico  Americas  1982   67.405   71640904   9611.147541
991          Mexico  Americas  1987   69.498   80122492   8688.156003
992          Mexico  Americas  1992   71.455   88111030   9472.384295
993          Mexico  Americas  1997   73.670   95895146   9767.297530
994          Mexico  Americas  2002   74.902  102479927  10742.440530
995          Mexico  Americas  2007   76.195  108700891  11977.574960
1608  United States  Americas  1952   68.440  157553000  13990.482080
1609  United States  Americas  1957   69.490  171984000  14847.127120
1610  United States  Americas  1962   70.210  186538000  16173.145860
1611  United States  Americas  1967   70.760  198712000  19530.365570
1612  United States  Americas  1972   71.340  209896000  21806.035940
1613  United States  Americas  1977   73.380  220239000  24072.632130
1614  United States  Americas  1982   74.650  232187835  25009.559140
1615  United States  Americas  1987   75.020  242803533  29884.350410
1616  United States  Americas  1992   76.090  256894189  32003.932240
1617  United States  Americas  1997   76.810  272911760  35767.433030
1618  United States  Americas  2002   77.310  287675526  39097.099550
1619  United States  Americas  2007   78.242  301139947  42951.653090

In [36]:
data_select.set_index('year', inplace = True)

In [37]:
data_select.head()

     country continent  lifeExp       pop    gdpPercap
year
1952  Canada  Americas    68.75  14785584  11367.16112
1957  Canada  Americas    69.96  17010154  12489.95006
1962  Canada  Americas    71.30  18985849  13462.48555
1967  Canada  Americas    72.13  20819767  16076.58803
1972  Canada  Americas    72.88  22284500  18970.57086

In [38]:
idx_select = data['country'].isin(['Canada','Mexico','United States'])
data_select = data.loc[idx_select]

In [41]:
data_select.set_index('year')
data_select.head()

AttributeError: 'NoneType' object has no attribute 'set_index'

In [40]:
data_select = data_select.set_index('year', inplace = True)

### Missing data and the quirks of nan

In [45]:
path_to_data = '../data/test_data_v2.csv'
test_data = pd.read_csv(path_to_data)

In [46]:
test_data.head()

  Continent                 Country  Year  Tourism_expenditure  Arrivals
0    Africa  Dem. Rep. of the Congo  1995                  NaN      35.0
1    Africa  Dem. Rep. of the Congo  2005                  3.0      61.0
2    Africa  Dem. Rep. of the Congo  2010                 11.0      81.0
3    Africa  Dem. Rep. of the Congo  2017                  6.0       NaN
4    Africa  Dem. Rep. of the Congo  2018                 61.0       NaN

#### Missing data

In [48]:
test_data.isnull()

    Continent  Country   Year  Tourism_expenditure  Arrivals
0       False    False  False                 True     False
1       False    False  False                False     False
2       False    False  False                False     False
3       False    False  False                False      True
4       False    False  False                False      True
5       False    False  False                False      True
6       False    False  False                False      True
7       False    False  False                False     False
8       False    False  False                False     False
9       False    False  False                False     False
10      False    False  False                False     False
11      False    False  False                False     False
12      False    False  False                False     False
13      False    False  False                False     False
14      False    False  False                False     False
15      False    False  False                False      True
16      False    False  False                False      True

In [49]:
import numpy as np
print(np.nan)

nan

In [50]:
#What if we want to find the observations where arrivals are missing?
idx_miss = test_data['Arrivals'] == np.nan
test_data.loc[idx_miss]

Empty DataFrame
Columns: [Continent, Country, Year, Tourism_expenditure, Arrivals]
Index: []

In [ ]:
#Hmmmm
#Let's try something

In [52]:
#Get the rows where Arrival is null
df = test_data
df[df['Arrivals'].isnull()]

   Continent                 Country  Year  Tourism_expenditure  Arrivals
3     Africa  Dem. Rep. of the Congo  2017                  6.0       NaN
4     Africa  Dem. Rep. of the Congo  2018                 61.0       NaN
5     Africa  Dem. Rep. of the Congo  2019                100.0       NaN
6     Europe                 Denmark  1995               3691.0       NaN
15    Africa                Djibouti  2017                 36.0       NaN
16    Africa                Djibouti  2018                 57.0       NaN

In [53]:
#How would we get the rows where it is NOT null?
df[~(df['Arrivals'].isnull())]

   Continent                 Country  Year  Tourism_expenditure  Arrivals
0     Africa  Dem. Rep. of the Congo  1995                  NaN      35.0
1     Africa  Dem. Rep. of the Congo  2005                  3.0      61.0
2     Africa  Dem. Rep. of the Congo  2010                 11.0      81.0
7     Europe                 Denmark  2005               5293.0    9178.0
8     Europe                 Denmark  2010               5704.0    8744.0
9     Europe                 Denmark  2017               8508.0   12426.0
10    Europe                 Denmark  2018               9097.0   12749.0
11    Europe                 Denmark  2019               8847.0   13285.0
12    Africa                Djibouti  1995                  5.0      21.0
13    Africa                Djibouti  2005                  7.0      30.0
14    Africa                Djibouti  2010                 18.0      51.0